<a href="https://github.com/spacelover92" style="color:blue;font-size:30px;font-family:Comic Sans MS">Spacelover92(Click to visit my github)</a>

### Question 1: 
##### Were there any warnings loading data into the JOBS table? What can be done to resolve this?
##### Hint: View the data loaded into this table and pay close attention to the JOB_TITLE column.

## Answer:
####     First we should alter table and change length of data type
####     As follows:
``` sql
ALTER TABLE "KWD86751"."JOBS" 
ALTER COLUMN JOB_TITLE
SET DATA TYPE VARCHAR(30);
```
#### With code above I changed VARCHAR from 15 to 30
#### Then we should load data into "JOBS" and overwrite them

***

### Question 2: 
##### Did all rows from the source file load successfully in the DEPARTMENT table? If not, are you able to figure out why not?
##### Hint: Look at the warning. Also, note the Primary Key for this table.

## Answer:
##### NO, this row
DEPT_ID_DEP|DEP_NAME|MANAGER_ID|LOC_ID
--- | --- | --- | ---
5|Software Group|30004|L0004
##### didn't load successfully because _DEPT_ID_DEP_ column is a _PRIMARY KEY_ and we have another row with _DEPT_ID_DEP_ 5 so we can't add another row with _DEPT_ID_DEP_ 5

***

### Query 1: Retrieve all employees whose address is in Elgin,IL
##### [Hint: Use the LIKE operator to find similar strings]

``` sql
SELECT * FROM employees
		WHERE address LIKE '%Elgin,IL%'
		
```

EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID
 --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- 
E1002|Alice|James|123457|1972-07-31|F|980 Berry ln, Elgin,IL|200|80000.00|30002|5
E1006|Nancy|Allen|123411|1978-02-06|F|111 Green Pl, Elgin,IL|600|90000.00|30001|2
E1010|Ann|Jacob|123415|1982-03-30|F|111 Britany Springs,Elgin,IL|220|70000.00|30004|5

***

### Query 2: Retrieve all employees who were born during the 1970's.
##### [Hint: Use the LIKE operator to find similar strings]

``` sql
SELECT * FROM employees
		WHERE b_date LIKE '197%'
		
```
EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID
 --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- 
E1001|John|Thomas|123456|1976-01-09|M|5631 Rice, OakPark,IL|100|100000.00|30001|2
E1002|Alice|James|123457|1972-07-31|F|980 Berry ln, Elgin,IL|200|80000.00|30002|5
E1006|Nancy|Allen|123411|1978-02-06|F|111 Green Pl, Elgin,IL|600|90000.00|30001|2
E1007|Mary|Thomas|123412|1975-05-05|F|100 Rose Pl, Gary,IL|650|65000.00|30003|7

***

### Query 3: Retrieve all employees in department 5 whose salary is between 60000 and 70000 .
##### [Hint: Use the keyword BETWEEN for this query ]

``` sql
SELECT * FROM employees
		WHERE dep_id = 5 AND salary BETWEEN 60000 AND 70000
```

EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID
 --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- 
E1004|Santosh|Kumar|123459|1985-07-20|M|511 Aurora Av, Aurora,IL|400|60000.00|30004|5
E1010|Ann|Jacob|123415|1982-03-30|F|111 Britany Springs,Elgin,IL|220|70000.00|30004|5

***

### Query 4A: Retrieve a list of employees ordered by department ID.
##### [Hint: Use the ORDER BY clause for this query]

``` sql
SELECT * FROM employees
		ORDER BY dep_id 
```

EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID
 --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- 
E1001|John|Thomas|123456|1976-01-09|M|5631 Rice, OakPark,IL|100|100000.00|30001|2
E1005|Ahmed|Hussain|123410|1981-01-04|M|216 Oak Tree, Geneva,IL|500|70000.00|30001|2
E1006|Nancy|Allen|123411|1978-02-06|F|111 Green Pl, Elgin,IL|600|90000.00|30001|2
E1002|Alice|James|123457|1972-07-31|F|980 Berry ln, Elgin,IL|200|80000.00|30002|5
E1003|Steve|Wells|123458|1980-08-10|M|291 Springs, Gary,IL|300|50000.00|30002|5
E1004|Santosh|Kumar|123459|1985-07-20|M|511 Aurora Av, Aurora,IL|400|60000.00|30004|5
E1010|Ann|Jacob|123415|1982-03-30|F|111 Britany Springs,Elgin,IL|220|70000.00|30004|5
E1007|Mary|Thomas|123412|1975-05-05|F|100 Rose Pl, Gary,IL|650|65000.00|30003|7
E1008|Bharath|Gupta|123413|1985-05-06|M|145 Berry Ln, Naperville,IL|660|65000.00|30003|7
E1009|Andrea|Jones|123414|1990-07-09|F|120 Fall Creek, Gary,IL|234|70000.00|30003|7

***

### Query 4B: Retrieve a list of employees ordered in descending order by department ID and within each department ordered alphabetically in descending order by last name.

``` sql
SELECT * FROM employees
		ORDER BY dep_id  DESC , l_name DESC
```

EMP_ID|F_NAME|L_NAME|SSN|B_DATE|SEX|ADDRESS|JOB_ID|SALARY|MANAGER_ID|DEP_ID
 --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- 
E1007|Mary|Thomas|123412|1975-05-05|F|100 Rose Pl, Gary,IL|650|65000.00|30003|7
E1009|Andrea|Jones|123414|1990-07-09|F|120 Fall Creek, Gary,IL|234|70000.00|30003|7
E1008|Bharath|Gupta|123413|1985-05-06|M|145 Berry Ln, Naperville,IL|660|65000.00|30003|7
E1003|Steve|Wells|123458|1980-08-10|M|291 Springs, Gary,IL|300|50000.00|30002|5
E1004|Santosh|Kumar|123459|1985-07-20|M|511 Aurora Av, Aurora,IL|400|60000.00|30004|5
E1002|Alice|James|123457|1972-07-31|F|980 Berry ln, Elgin,IL|200|80000.00|30002|5
E1010|Ann|Jacob|123415|1982-03-30|F|111 Britany Springs,Elgin,IL|220|70000.00|30004|5
E1001|John|Thomas|123456|1976-01-09|M|5631 Rice, OakPark,IL|100|100000.00|30001|2
E1005|Ahmed|Hussain|123410|1981-01-04|M|216 Oak Tree, Geneva,IL|500|70000.00|30001|2
E1006|Nancy|Allen|123411|1978-02-06|F|111 Green Pl, Elgin,IL|600|90000.00|30001|2

***

### Query 5A: For each department ID retrieve the number of employees in the department.
##### [Hint: Use COUNT(*) to retrieve the total count of a column, and then GROUP BY]

``` sql
SELECT dep_id , COUNT(*) AS total_num_emp FROM employees
		GROUP BY dep_id
		ORDER BY dep_id
```

DEP_ID|TOTAL_NUM_EMP
 --- | ---
2|3
5|4
7|3

***

### Query 5B: For each department retrieve the number of employees in the department, and the average employees salary in the department.
##### [Hint: Use COUNT(*) to retrieve the total count of a column, and AVG() function to compute average salaries, and then group]

``` sql
SELECT dep_id , COUNT(*) AS total_num_emp, AVG(salary) AS average_salary FROM employees
		GROUP BY dep_id
		ORDER BY dep_id
```


 DEP_ID|TOTAL_NUM_EMP|AVERAGE_SALARY
  --- | --- | ---
2|3|86666.66666666666666666666666
5|4|65000.00000000000000000000000
7|3|66666.66666666666666666666666

***

### Query 5C: Label the computed columns in the result set of Query 5B as “NUM_EMPLOYEES” and “AVG_SALARY”.
##### [Hint: Use AS “LABEL_NAME” after the column name]

``` sql
SELECT dep_id , COUNT(*) AS NUM_EMPLOYEES, AVG(salary) AS AVG_SALARY FROM employees
		GROUP BY dep_id
		ORDER BY dep_id
```

 DEP_ID|NUM_EMPLOYEES|AVG_SALARY
  --- | --- | ---
2|3|86666.66666666666666666666666
5|4|65000.00000000000000000000000
7|3|66666.66666666666666666666666

***

### Query 5D: In Query 5C order the result set by Average Salary.
##### [Hint: Use ORDER BY after the GROUP BY]

``` sql
SELECT dep_id , COUNT(*) AS NUM_EMPLOYEES, AVG(salary) AS AVG_SALARY FROM employees
		GROUP BY dep_id
		ORDER BY AVG_SALARY
```

 DEP_ID|NUM_EMPLOYEES|AVG_SALARY
  --- | --- | ---
5|4|65000.00000000000000000000000
7|3|66666.66666666666666666666666
2|3|86666.66666666666666666666666

***

### Query 5E: In Query 5D limit the result to departments with fewer than 4 employees.
##### [Hint: Use HAVING after the GROUP BY, and use the count() function in the HAVING clause instead of the column label.
##### Note: WHERE clause is used for filtering the entire result set whereas the HAVING clause is used for filtering the result of the grouping]

``` sql
SELECT dep_id , COUNT(*) AS NUM_EMPLOYEES, AVG(salary) AS AVG_SALARY FROM employees
		GROUP BY dep_id
		HAVING COUNT(*) < 4
		ORDER BY AVG_SALARY
```

 DEP_ID|NUM_EMPLOYEES|AVG_SALARY
  --- | --- | ---
7|3|66666.66666666666666666666666
2|3|86666.66666666666666666666666

***

### BONUS Query 6: Similar to 4B but instead of department ID use department name. Retrieve a list of employees ordered by department name, and within each department ordered alphabetically in descending order by last name.
##### [Hint: Department name is in the DEPARTMENTS table. So your query will need to retrieve data from more than one table. Don’t worry if you are not able to figure this one out … we’ll cover working with multiple tables in the next lesson.]

``` sql
SELECT departments.dep_name ,l_name 
		FROM employees LEFT JOIN departments
        ON employees.dep_id = departments.dept_id_dep
		ORDER BY departments.dep_name , l_name DESC
```

	
DEP_NAME|L_NAME
---|---
Architect Group|Thomas
Architect Group|Hussain
Architect Group|Allen
Design Team|Thomas
Design Team|Jones
Design Team|Gupta
Software Group|Wells
Software Group|Kumar
Software Group|James
Software Group|Jacob

***

<b>Answers from :<b/> <a href="https://github.com/spacelover92" style="color:blue;font-size:30px;font-family:Comic Sans MS">Spacelover92(Click to visit my github)</a>